//SBGOLOBM JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//*    RUN JCL FOR THE PRECIS TAPE MAPPING PROGRAM
//*
//PRECIS   PROC VOL=
//PRECIS   EXEC PGM=PRECIS,PARM=',,,'
//STEPLIB  DD  DISP=SHR,DSN=SYS1.W$$.LINKLIB
//SYSPRINT DD  SYSOUT=*
//VOLUME   DD  UNIT=562,VOL=SER=&VOL,DISP=(OLD,KEEP),
//             LABEL=EXPDT=98000
//         PEND
//PRECIS   EXEC PRECIS,VOL=C500MU
